# Relatório de Análise VII

## Criando Agrupamentos

In [1]:
import pandas as pd

In [2]:
dados = pd.read_csv('dados/aluguel_residencial.csv', sep = ';')

In [16]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU,Valor m2,Tipo agregado
15,Apartamento,Tijuca,2,1,0,110,1900.0,700.0,138.0,17.27,Apartamento
18,Apartamento,Tijuca,2,1,0,78,2000.0,700.0,0.0,25.64,Apartamento
20,Apartamento,Tijuca,1,0,0,48,750.0,772.0,25.0,15.62,Apartamento
80,Apartamento,Tijuca,2,1,0,80,1800.0,1100.0,84.0,22.50,Apartamento
82,Apartamento,Tijuca,3,1,0,172,2700.0,780.0,170.0,15.70,Apartamento

In [4]:
dados['Valor'].mean()

5046.172821405663

In [8]:
bairros = ['Barra da Tijuca', 'Copacabana', 'Ipanema', 'Leblon', 'Botafogo', 'Flamengo', 'Tijuca']
selecao = dados['Bairro'].isin(bairros)
dados = dados[selecao]

In [9]:
dados['Bairro'].drop_duplicates()

0          Copacabana
5     Barra da Tijuca
15             Tijuca
19            Ipanema
23           Botafogo
27             Leblon
78           Flamengo
Name: Bairro, dtype: object

In [10]:
grupo_bairro = dados.groupby('Bairro')

In [12]:
grupo_bairro.groups

{'Barra da Tijuca': Int64Index([    5,    14,    16,    21,    30,    32,    35,    42,    43,
                60,
             ...
             21769, 21771, 21774, 21782, 21800, 21801, 21811, 21812, 21813,
             21820],
            dtype='int64', length=3863),
 'Botafogo': Int64Index([   23,    48,    87,    88,   111,   119,   127,   134,   196,
               200,
             ...
             21471, 21487, 21499, 21529, 21653, 21660, 21666, 21715, 21746,
             21790],
            dtype='int64', length=873),
 'Copacabana': Int64Index([    0,     9,    10,    11,    24,    25,    28,    31,    86,
                91,
             ...
             21707, 21713, 21736, 21743, 21780, 21783, 21795, 21809, 21810,
             21815],
            dtype='int64', length=2644),
 'Flamengo': Int64Index([   78,   138,   218,   284,   321,   347,   356,   361,   369,
               393,
             ...
             21527, 21560, 21581, 21629, 21680, 21704, 21728, 21731, 21740,
             21794],
            dtype='int64', length=714),
 'Ipanema': Int64Index([   19,    39,    40,    45,    52,    53,    73,    84,    92,
               114,
             ...
             21718, 21722, 21730, 21739, 21744, 21745, 21754, 21788, 21796,
             21817],
            dtype='int64', length=1764),
 'Leblon': Int64Index([   27,    59,    90,    97,   115,   133,   161,   167,   171,
               213,
             ...
             21721, 21761, 21770, 21777, 21785, 21786, 21787, 21808, 21816,
             21825],
            dtype='int64', length=1258),
 'Tijuca': Int64Index([   15,    18,    20,    80,    82,   126,   145,   149,   158,
               164,
             ...
             21573, 21577, 21607, 21610, 21661, 21675, 21714, 21729, 21773,
             21818],
            dtype='int64', length=1100)}

In [18]:
for bairro, dados in grupo_bairro:
    print('{} -> {}'.format(bairro, dados['Valor'].mean()))

Barra da Tijuca -> 7069.552938130986
Botafogo -> 8791.828178694159
Copacabana -> 4126.677004538578
Flamengo -> 4113.526610644258
Ipanema -> 9352.001133786847
Leblon -> 8746.344992050874
Tijuca -> 2043.52

In [19]:
grupo_bairro['Valor'].mean()

Bairro
Barra da Tijuca    7069.552938
Botafogo           8791.828179
Copacabana         4126.677005
Flamengo           4113.526611
Ipanema            9352.001134
Leblon             8746.344992
Tijuca             2043.520000
Name: Valor, dtype: float64

In [21]:
grupo_bairro[['Valor', 'Condominio']].mean()

                       Valor   Condominio
Bairro
Barra da Tijuca  7069.552938  3591.013461
Botafogo         8791.828179   976.281787
Copacabana       4126.677005  1148.682300
Flamengo         4113.526611  1102.149860
Ipanema          9352.001134  2244.442177
Leblon           8746.344992  2107.184420
Tijuca           2043.520000   711.690000